[
  {
    "title": "IEEE Conference Presentation 2025 – IEEE SILCON",
    "description": "Presented as the main author the research paper: \"Machine Learning for Early Detection and Risk Stratification of Chronic Kidney Disease\" at the IEEE SILCON 2025 International Conference, organized by NIT Nagaland. [View ORCID Profile](https://orcid.org/0009-0005-3878-7317)"
  },
  {
    "title": "IEEE Conference Presentation 2025",
    "description": "Delivered a presentation as the main author at an IEEE-recognized international conference, showcasing the research paper: \"EDS-DPCXT: Efficient Data Security Using a Deque-Based Product Cipher and XOR-Based Transformations.\" [View ORCID Profile](https://orcid.org/0009-0005-3878-7317)"
  },
  {
    "title": "International Conference Presentation 2025 – ICMCE",
    "description": "Presented as the main author the research paper: \"Spam Detection with AdaBoost and Random Forest\" at the International Conference on Modern Trends in Computers and Electronics (ICMCE-2025). [Read Publication](https://iipbooks.com/books/3007/wishlist.html)"
  },
  {
    "title": "ICAAST 2025 – International Conference Presentation",
    "description": "Presented the research paper titled: \"Sleep Disorders Classification using Multidimensional Health and Behavioral Data: A Machine Learning Approach\" at the 1st International Conference on Advances in Applied Sciences and Technologies (ICAAST-2025), organized by COER University, Roorkee, Uttarakhand."
  },
  {
    "title": "Book Chapter Publication 2025",
    "description": "Authored a book chapter titled: \"Predictive Modelling for Hepatitis C Diagnosis Using SMOTE and Supervised Learning Techniques\" published in 'Engineering AI for Healthcare: Models, Data, and Applications (2025)'. [Read on Google Books](https://play.google.com/store/books/details?id=DBqPEQAAQBAJ)"
  },
  {
    "title": "Conference Paper Publication 2025",
    "description": "Authored the paper: \"Spam Detection with AdaBoost and Random Forest\" published in 'Trends and Challenges in Electronics and Computer Systems (2025)'. [Read Publication](https://iipbooks.com/books/3007/wishlist.html)"
  },
  {
    "title": "Leading Research Mentor – DcodersSquad",
    "description": "Leading a team of 5 members in the DcodersSquad Research Group, mentoring them in machine learning research, publication preparation, and experimentation. [View ORCID Profile](https://orcid.org/0009-0005-3878-7317)"
  },
  {
    "title": "Uttrakhand State Badminton Player",
    "description": "Competed in state-level badminton tournaments representing Uttarakhand."
  },
  {
    "title": "Title of \"Cheetah\" at DcodersSquad",
    "description": "Recognized for outstanding speed, precision, and performance in technical projects and problem-solving at the COER Tech Group."
  },
  {
    "title": "Appreciation from HOD of CSE",
    "description": "Received recognition for exceptional contributions to DcodersSquad and the CSE Department for leadership and research excellence."
  }
]
